# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [2]:
#Your code here
c.execute("""SELECT firstname, lastname
FROM employees e 
JOIN offices o ON e.officeCode = o.officeCode
WHERE o.city = 'Boston';""")
c.fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [15]:
#Your code here
c.execute("""SELECT o.officeCode, city, COUNT(e.employeeNumber)
FROM offices o
LEFT JOIN employees e ON o.officeCode = e.officeCode
GROUP BY o.officeCode, city""")
c.fetchall()

[('1', 'San Francisco', 6),
 ('2', 'Boston', 2),
 ('3', 'NYC', 2),
 ('4', 'Paris', 5),
 ('5', 'Tokyo', 2),
 ('6', 'Sydney', 4),
 ('7', 'London', 2)]

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
#What is the office city with the highest amount of sales?
#What is the name of the sales rep with the highest amount of sales?
#What is the product name with the highest number of orders?

In [20]:
# Your code here
c.execute("""SELECT of.city, SUM(od.quantityOrdered*od.priceEach) as sales
FROM orderdetails od
JOIN orders o ON od.orderNumber = o.orderNumber
JOIN customers c ON o.customerNumber = c.customerNumber
JOIN employees e ON c.salesRepEmployeeNumber = e.employeeNumber
JOIN offices of ON e.officeCode = of.officeCode
GROUP BY of.city
ORDER BY sales DESC;""")
df = pd.DataFrame(c.fetchall())
df.columns = [column[0] for column in c.description]
df

            city       sales
0          Paris  3083761.58
1         London  1436950.70
2  San Francisco  1429063.57
3            NYC  1157589.72
4         Sydney  1147176.35
5         Boston   892538.62
6          Tokyo   457110.07

In [22]:
# Your code here
c.execute("""SELECT e.firstname, e.lastname, SUM(od.quantityOrdered*od.priceEach) as sales
FROM orderdetails od
JOIN orders o ON od.orderNumber = o.orderNumber
JOIN customers c ON o.customerNumber = c.customerNumber
JOIN employees e ON c.salesRepEmployeeNumber = e.employeeNumber
GROUP BY e.firstname, e.lastname
ORDER BY sales DESC;""")
df = pd.DataFrame(c.fetchall())
df.columns = [column[0] for column in c.description]
df

   firstName   lastName       sales
0     Gerard  Hernandez  1258577.81
1     Leslie   Jennings  1081530.54
2     Pamela   Castillo   868220.55
3      Larry       Bott   732096.79
4      Barry      Jones   704853.91
5     George     Vanauf   669377.05
6      Peter      Marsh   584593.76
7       Loui     Bondur   569485.75
8       Andy     Fixter   562582.59
9      Steve  Patterson   505875.42
10  Foon Yue      Tseng   488212.67
11      Mami      Nishi   457110.07
12    Martin     Gerard   387477.47
13     Julie   Firrelli   386663.20
14    Leslie   Thompson   347533.03

In [24]:
# Your code here
c.execute("""SELECT p.productName, SUM(od.quantityOrdered) as orders
FROM products p
JOIN orderDetails od ON p.productCode = od.productCode
GROUP BY p.productName
ORDER BY orders DESC;""")
df = pd.DataFrame(c.fetchall())
df.columns = [column[0] for column in c.description]
df

                                 productName  orders
0                1992 Ferrari 360 Spider red    1808
1                       1937 Lincoln Berline    1111
2                  American Airlines: MD-11S    1085
3    1941 Chevrolet Special Deluxe Cabriolet    1076
4               1930 Buick Marquette Phaeton    1074
5                           1940s Ford truck    1061
6      1969 Harley Davidson Ultimate Chopper    1057
7                          1957 Chevy Pickup    1056
8                     1964 Mercedes Tour Bus    1053
9                    1956 Porsche 356A Coupe    1052
10                  Corsair F4U ( Bird Cage)    1051
11                        F/A 18 Hornet 1/72    1047
12               1980s Black Hawk Helicopter    1040
13               1913 Ford Model T Speedster    1038
14                         1997 BMW R 1100 S    1033
15                       1972 Alfa Romeo GTA    1030
16                  1962 Volkswagen Microbus    1029
17                          2002 Suzuki XREO    1028
18                 The USS Constitution Ship    1020
19                         2001 Ferrari Enzo    1019
20                  1960 BSA Gold Star DBD34    1015
21                          1997 BMW F650 ST    1014
22                 1957 Corvette Convertible    1013
23                     18th century schooner    1011
24                   1900s Vintage Tri-Plane    1009
25                    1940 Ford Pickup Truck     999
26                     1996 Moto Guzzi 1100i     999
27                     1926 Ford Fire Engine     998
28                           1982 Camaro Z28     997
29                   1939 Cadillac Limousine     995
..                                       ...     ...
79                  1917 Grand Touring Sedan     918
80                  Collectable Wooden Train     918
81                          1995 Honda Civic     917
82                            P-51-D Mustang     917
83                 1966 Shelby Cobra 427 S/C     915
84                     1976 Ford Gran Torino     915
85                     1965 Aston Martin DB5     914
86                   1982 Lamborghini Diablo     912
87               1980’s GM Manhattan Express     911
88       18th Century Vintage Horse Carriage     907
89                         1982 Ducati 996 R     906
90                   1970 Plymouth Hemi Cuda     900
91                 1974 Ducati 350 Mk3 Desmo     898
92                             The Mayflower     898
93                                HMS Bounty     897
94                            The Queen Mary     896
95                       2002 Chevy Corvette     894
96               American Airlines: B767-300     894
97                 1937 Horch 930V Limousine     884
98                         1903 Ford Model A     883
99                    1928 Mercedes-Benz SSK     880
100                        1952 Citroen-15CV     873
101                1969 Chevrolet Camaro Z28     870
102        1992 Porsche Cayenne Turbo Silver     867
103      1932 Alfa Romeo 8C2300 Spider Sport     866
104             1999 Indy 500 Monte Carlo SS     855
105                       1911 Ford Town Car     832
106         1936 Mercedes Benz 500k Roadster     824
107               1970 Chevy Chevelle SS 454     803
108                    1957 Ford Thunderbird     767

[109 rows x 2 columns]

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!